#include "Connection.h"

#include <NWN2Lib/NWN2.h>
#include <NWN2Lib/NWN2Common.h>
#include <hook/scriptManagement.h>
#include <misc/log.h>
#include <nwn2heap.h>
#include "Anticheat.h"

#include <bit>
#include <cassert>
#include <charconv>
#include <detours/detours.h>
#include <optional>
#include <string_view>
#include <iostream>
#include <array>
#include <span>
#include <fstream>
#include "../../septutil/srvadmin.h"
#include "../../septutil/bytearray.h"

#define MAX_PLAYERS               0x60

#define G_GLOBAL_GAME_STATE		0x86443C

HMODULE XPBugfix;

std::unique_ptr<LogNWNX> logger;

namespace {
	auto plugin = std::unique_ptr<MsgServ>();
}

typedef
BOOL
(__stdcall *
	SendMessageToPlayer)(
		__in unsigned long PlayerId,
		__in_bcount(Size) unsigned char* Data,
		__in unsigned long Size,
		__in unsigned long Flags
		);

SendMessageToPlayer     SendMessageToPlayer_;

typedef
void
(__stdcall * OnPlayerConnectionCloseProc)(
	__in unsigned long PlayerId,
	__in void * Context
	);

typedef
BOOL
(__stdcall * OnPlayerConnectionReceiveProc)(
	__in unsigned long PlayerId,
	__in_bcount( Length ) const unsigned char * Data,
	__in size_t Length,
	__in void * Context
	);

typedef
BOOL
(__stdcall * OnPlayerConnectionSendProc)(
	__in unsigned long PlayerId,
	__in_bcount( Size ) unsigned char * Data,
	__in unsigned long Size,
	__in unsigned long Flags,
	__in void * Context
	);


typedef
void
(__stdcall *
	SetPacketFilterCallouts)(
		__in void* Context,
		__in OnPlayerConnectionCloseProc OnClose,
		__in OnPlayerConnectionReceiveProc OnReceive,
		__in OnPlayerConnectionSendProc OnSend
		);

SetPacketFilterCallouts     SetPacketFilterCallouts_;


struct CPlayerCDKeyInfo
{
	NWN::CExoString m_Key;
	NWN::CExoString m_ValidCode;
	NWN::CExoString m_NotUsed;
};

struct BigPlayerInfo // sizeof = 0x78, CNetLayerPlayerInfo
{
	int            m_bPlayerInUse;              // 00
	NWN::CExoString     m_sPlayerName;               // 04
	char           skip0[0x04];                 // 0c
	unsigned long  m_nSlidingWindowId;          // 10
	int            m_bPlayerPrivileges;         // 14
	int            m_bGameMasterPrivileges;     // 18
	int            m_bServerAdminPrivileges;    // 1c
	char           skip1[0x38];                 // 20
	CPlayerCDKeyInfo* m_lstKeys;				// 58
	int				m_nNumberKeys;				// 5C
	char			skip2[0x18];			// 60
};


struct CShortNetLayerInternal
{
	void         *ServerApp;                 // 00000
	char		 skip0[0x3768C];
	//CExoNet      *Net;                       // 00004
	//char          skip0[0x04];               // 00008
	//SlidingWindow Windows[MAX_PLAYERS];      // 0000c
	//char          skip1[0x04];               // 3768C
	BigPlayerInfo    Players[MAX_PLAYERS];      // 37690
											 // CExoNetExtendableBuffer FrameStorage; // 3A390
};


typedef
const char *
(__stdcall *
GetPlayerAccountName)(
	__in unsigned long PlayerId
);


GetPlayerAccountName     GetPlayerAccountName_;


typedef
bool
(__stdcall*
	GetPlayerConnectionInfo)(
		__in unsigned long PlayerId,
		__out PSOCKADDR_IN Sin
		);

GetPlayerConnectionInfo GetPlayerConnectionInfo_;


	MsgServ* g_msgServ;

NWN::OBJECTID GetModuleID_()
{
	int ptr = *(int*)OFFS_g_pAppManager;
	ptr = *(int*)(ptr + 4);
	ptr = *(int*)(ptr + 4);
	NWN::OBJECTID result = *(NWN::OBJECTID*)(ptr + 0x10088);
	return result;
}

